#include <stdio.h> // подключение бибилиотек
#include <math.h>
#include <unistd.h>
#include <stdlib.h>
#include <time.h>

#define POLZOVATEL_PROIGRAL 1 // объявление константы равной единице
// объявление функций
void WIN (int*, int*, int*, int*);
void GENER (int);
int EndGame(int,int,int,int*);
void clear(void);
void clearStream (void);
int game (int);
int option();
// данная функция позволяет выбрать опцию, такую как выбор первоначального счёта
int option()
{
	int i;
	printf("Введите желаемый первоначальный счет");
	scanf("%d",&i);//выбор режима
	return i;
}

// главная функция
int main()
{
	//объвление переменных
	int i,SCHIT=100,x=1;
	do{
		printf (" 1) Старт игры\n 2) Опции\n 3) выход\n");
		scanf("%d",&i);// Выбор операции 
		switch ( i )// 
		{
			case 1:
			game(SCHIT);// Старт игры
			break;
			case 2:
			SCHIT=option();// выбор режима
			break;
			case 3:
			return 0;// выход из игры
			default:
			printf("Некорректный ввод");
			break;
		}
	}while(x==1);
	return 0;
}


// функция в которой генерируется сумма выпавших костей
int game (int SCHIT)
{
    int STAVKA, summa, k, r, U, y=1;
    while(y==1){
    {
            clear();
   WIN(&U,&STAVKA,&summa,&SCHIT);

    printf ("\x1b[1;33mТеперь Крупье бросит кости..\n\n\x1b[0m");
    usleep(2000000);
    srand(time(NULL));

    k=rand()%6+1;
    r=rand()%6+1;

    GENER (k);
    GENER (r);

    summa=r+k;

    printf ("\n\n\x1b[1;33mСумма выпавших костей = \x1b[1;37m%d\n \x1b[0m", summa);

    if (EndGame(U,STAVKA,summa,&SCHIT)){
                printf("Вы проиграли !\n\n");
				printf ("\x1b[5;32m"	
"                                     *   *   *    *                                       *    *   *   *                                      \n"
"                              *  *|||||||||||||||||||*                                 *|||||||||||||||||||*  *                               \n"
"                           *||||||||||||||||||||||||||||*                           *||||||||||||||||||||||||||||*                            \n"
"                        *|||||||||||||||||||||||||||||||||*                       *|||||||||||||||||||||||||||||||||*                         \n"
"                     *||||||||╔═══╦══╦╗──╔╦═══╗||||||||||||*                     *||||||||||||╔══╦╗╔╦═══╦═══╗||||||||||*                      \n"
"                   *||||||||||║╔══╣╔╗║║──║║╔══╝|||||||||||||*                   *|||||||||||||║╔╗║║║║╔══╣╔═╗║||||||||||||*                    \n"
"             *  *|||||||||||||║║╔═╣╚╝║╚╗╔╝║╚══╗|||||||||||||*                   *|||||||||||||║║║║║║║╚══╣╚═╝║|||||||||||||||*  *              \n"
"       *  *|||||||||||||||||||║║╚╗║╔╗║╔╗╔╗║╔══╝|||||||||||||*                   *|||||||||||||║║║║╚╝║╔══╣╔╗╔╝|||||||||||||||||||||*  *        \n"
"     *||||||||||||||||||||||||║╚═╝║║║║║╚╝║║╚══╗||||||||||||*                     *||||||||||||║╚╝╠╗╔╣╚══╣║║║||||||||||||||||||||||||||||*     \n"
"   *||||||||||||||||||||||||||╚═══╩╝╚╩╝──╚╩═══╝|||||||||||*                       *|||||||||||╚══╝╚╝╚═══╩╝╚╝|||||||||||||||||||||||||||||*    \n"
"      *||||||||||*  *||||||||||||||||||||||||||||||||||| *                         *||||||||||||||||||||||||||||||||||||*  *|||||||||||*      \n"
"        *  *  *       *|||||||||||||||||||||||||||||||||*                           *|||||||||||||||||||||||||||||||||*       *  *  *         \n"
"                     *|||||||||||||||||||||||||||||||||*                             *|||||||||||||||||||||||||||||||||*                      \n"
"                    *|||||||||||||||||||||||* *|||||||*                               *|||||||* *|||||||||||||||||||||||*                     \n"
"                   *||||||||||||||||||||||*|||||*||||*                                 *||||*|||||*||||||||||||||||||||||*                    \n"
"                  *|||||||*||||||||*|||||*||||||||||*                                   *||||||||||*|||||*||||||||*|||||||*                   \n"
"                 *|||||||*||||||||*||||||*|||||||||*                                     *|||||||||*||||||*||||||| *|||||||*                  \n"
"                *|||||||* *||||||*||||||||* *|||||*                                       *|||||* *||||||||*||||||* *|||||||*                 \n"
"               *|||||||* *||||||* * *||||*    * *                                           * *    *||||* * *||||||* *|||||||*                \n"
"              *|||||||*  *||||*||||||||||*                                                         *||||||||||*||||*  *|||||||*               \n"
"            *|||||||*   *||||*|||||||||*                                                             *|||||||||*||||*   *|||||||*             \n"
"          *|||||||*    *|||||* * * * *                                                                 * * * * *|||||*    *|||||||*           \n"
"        *|||||||*     *||||||*                                                                                 *||||||*     *|||||||*         \n"
"      *|||||||*      *||||||*                                                                                   *||||||*      *|||||||*       \n"
"      *|||||*      *||||||*                                                                                       *||||||*      *|||||*       \n"
"        * *        *|||||*                                                                                         *|||||*        * *         \n"
"                     * *                                                                                              * *                     \n"
"                                                                                                                                              \x1b[0m\n");
            return 0;
        }
clearStream();

    printf("Желаете продолжить?\n 1.Да\n 2.Нет\n");
    scanf("%d", &y);
    }
}
    return 0;
}


// сама функция генерации случайных чисел от 1 до 6, реализованная в виде кубиков
void GENER (int k)
{
    if (k==1)
    {
        printf ("     _______  \n"
                "   /|       | \n"
                "   /|   *   | \n"
                "   /|       | \n"
                "   /////////  \n");
    }

    if (k==2)
    {
        printf ("     _______  \n"
                "   /| *     | \n"
                "   /|       | \n"
                "   /|     * | \n"
                "   /////////  \n");
    }

    if (k==3)
    {
        printf ("     _______  \n"
                "   /| *     | \n"
                "   /|   *   | \n"
                "   /|     * | \n"
                "   /////////  \n");
    }

    if (k==4)
    {
        printf ("     _______  \n"
                "   /| *   * | \n"
                "   /|       | \n"
                "   /| *   * | \n"
                "   /////////  \n");
    }

    if (k==5)
    {
        printf ("     _______  \n"
                "   /| *   * | \n"
                "   /|   *   | \n"
                "   /| *   * | \n"
                "   /////////  \n");
    }

    if (k==6)
    {
        printf ("     _______  \n"
                "   /| * * * | \n"
                "   /| * * * | \n"
                "   /| * * * | \n"
                "   /////////  \n");
    }
}



// функция наальных действий Игрока
void WIN (int* U , int* STAVKA, int* summa, int* SCHIT )
{

    do
    {
    printf ("\x1b[5;32m  "
	        "            Добро пожаловать в игру ''Кости''!\n\n"
	        "   Просим Вас, уважаемый игрок, выбрать одно число в диапазоне от 2 до 12\n"
            "                    Введите Ваше число: \x1b[0m");
    while(scanf ("%d", U) != 1 ){

    printf("\n  Хах, вероятно Вы промахнулись,\n ничего, со всеми бывает\n   попробуйте снова!\n");
        clearStream();
        }
    }
    while ((*U<2) || (*U>12));

	printf ("\x1b[1;33m Текущий счёт:\x1b[0m  \x1b[1;37m%d\n \x1b[0m", *SCHIT);
    printf ("\x1b[1;33m Сделайте вашу ставку: \x1b[0m");
    do{
        scanf ("%d", STAVKA);
        if (*STAVKA > *SCHIT){
                printf("                  error...\n"
				       " Неверно введено число, повторите попытку\n\n");
        }
        }
        while (*STAVKA <=0 || *STAVKA>*SCHIT);
}


// функция с условиями выйгрыша и проигрыша
int  EndGame(int U , int STAVKA, int summa, int *SCHIT)
{
        if  (summa==U)
    {
        printf ("           Выйграшная стратегия! \n   "
                "      Вы получаете 4х ставку!\n");
        *SCHIT+=STAVKA*4 ;

        printf (" \n\n"
                "__________\nВашa ставка___ %d\nТекущий счёт___ %d\n__________\n", STAVKA, *SCHIT);
    }

    else if ((summa<7) && (U<7))
    {
        printf ("         Выйграшная стратегия! \n"
                "     Вы выигрываете сделанную ставку!\n");
        *SCHIT+=STAVKA;

        printf (" \n\n"
                "__________\nВашa ставка___ %d\nТекущий счёт___ %d\n__________\n", STAVKA, *SCHIT);
    }
    else if  ((summa>7) && (U>7))
    {
        printf ("         Выйграшная стратегия! \n  "
                "     Вы выигрываете сделанную ставку!\n");

        *SCHIT+=STAVKA;

        printf (" \n\n"
                "__________\nВашa ставка___ %d\nТекущий счёт___ %d\n__________\n", STAVKA, *SCHIT);
    }
    else
    {
        printf("__________\n  Вашa ставка___ %d\nТекущий счёт___ %d\n__________\n",STAVKA, *SCHIT);
         // (SCHIT>=0){
        *SCHIT-=STAVKA;
                if ((*SCHIT <=0)||(*SCHIT>=200)){
                        printf ("\n\n\n");
                        return POLZOVATEL_PROIGRAL;
                }
        printf ("        К сожалению, Вы проиграли Вашу ставку...\n"
                "         деньги перешли на счёт банка Казино.\n"
                "               Ваш текущий счёт: %d\n", *SCHIT);


    }
        return 0;
}
// функция очистки некоторой части экрана, что бы не мешала предыдущая итерация действий
void clear()
{
    printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
}


//функция против случайного ввода не того символа
void clearStream()
{
  int c;
  while((c = getchar()) && c != EOF && c != '\n');
}
